<?php

return [

	/*
	|------------------------------------------------------------------
	|  JSON-поля, которые вытягиваем как атрибуты
	|------------------------------------------------------------------
	*/
	'extra_attributes' => [
		'seller_id'       => 'Seller ID',
		'producer_id'     => 'Producer ID',
		'state'           => 'Condition',
		'discount'        => 'Discount (%)',
		'comments_amount' => 'Reviews',
	],

	/*
	|------------------------------------------------------------------
	|  Временное окно работы парсера (сек)
	|------------------------------------------------------------------
	*/
	'runner_window' => 5,

	/*
	|------------------------------------------------------------------
	|  Интервал опроса (polling) виджетов Dashboard
	|  Формат: '10s', '30s', '1m' и т.д.
	|------------------------------------------------------------------
	*/
	'dashboard_polling_interval' => env('DASHBOARD_POLLING_INTERVAL', '2s'),

];
