<?php

return [

	/*
	|------------------------------------------------------------------
	|  JSON-поля, которые вытягиваем как атрибуты
	|------------------------------------------------------------------
	*/
	'extra_attributes' => [
		'seller_id'        => 'Seller ID',
		'producer_id'      => 'Producer ID',
		'state'            => 'Condition',
		'discount'         => 'Discount (%)',
		'comments_amount'  => 'Reviews',
	],

	/*
	|------------------------------------------------------------------
	|  Временное окно, в течение которого парсер работает при одном
	|  запуске cron-job’а (секунд). 50 сек оставляет 10 сек запас.
	|------------------------------------------------------------------
	*/
	'runner_window' => 50,

];
